# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [5]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [6]:
raw_1 = pd.Series(np.random.randint(1,5,100))
raw_2 = pd.Series(np.random.randint(1,4,100))
raw_3 = pd.Series(np.random.randint(10000,30001,100))

### Step 3. Let's create a DataFrame by joinning the Series by column

In [9]:
data = pd.concat([raw_1, raw_2, raw_3], axis=1)
data

    0  1      2
0   4  2  15690
1   3  1  16670
2   4  2  17664
3   4  2  14912
4   3  2  17547
.. .. ..    ...
95  3  1  24559
96  3  2  20594
97  4  1  13390
98  3  2  18146
99  1  3  28599

[100 rows x 3 columns]

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [11]:
data.rename(columns = {0:'bedrs', 1:'bathrs', 2:'price_sqr_meter'}, inplace = True)
data.head()

   bedrs  bathrs  price_sqr_meter
0      4       2            15690
1      3       1            16670
2      4       2            17664
3      4       2            14912
4      3       2            17547

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [14]:
bigcolumn = pd.concat([raw_1, raw_2, raw_3]).to_frame()
bigcolumn

        0
0       4
1       3
2       4
3       4
4       3
..    ...
95  24559
96  20594
97  13390
98  18146
99  28599

[300 rows x 1 columns]

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [15]:
len(bigcolumn)

300

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [18]:
bigcolumn.reset_index(drop=True, inplace=True)
bigcolumn

         0
0        4
1        3
2        4
3        4
4        3
..     ...
295  24559
296  20594
297  13390
298  18146
299  28599

[300 rows x 1 columns]